# Варіант №12
#
#   Напишіть програму, яка допомагає знайти число
#   (НСК - найменше спільне кратне) двох чисел.
#   Програма повинна зчитувати два додатних цілих
#   числа a і b (кожне число вводиться на окремому рядку)
#   і виводити найменше число, яке ділиться на обидва
#   цих числа без залишку. НСК(a, b) = |ab| / НСД(a, b),
#   де НСД(a, b) - найбільший спільний дільник чисел a, b.
#
# Дзюба Владислав

a = int(input("Введіть ціле додатне число a: "))
b = int(input("Введіть ціле додатне число b: "))
c = a * b
while a != b:
    if a > b:
        a = a - b
    else:
        b = b - a
nsk = c // a
print(f"Найменше число, яке ділиться на обидва цих числа без залишку {nsk}")
